STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/esl_profile_ap.c
/**
  ******************************************************************************
  * @file    esl_profile_ap.c
  * @author  GPM WBL Application Team
  * @brief   Implementation of ESL commands management.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#include <stdint.h>
#include <stdlib.h>
#include <assert.h>
#include <stdbool.h>
#include "ble.h"
#include "esl_profile_ap.h"
#include "app_common.h"
#include "stm_list.h"
#include "gatt_client_app.h"    
#include "stm32_seq.h"
#include "app_ble.h"    

#define MAX_ESL_PAYLOAD_SIZE                    (48U)
#define EAD_MIC_SIZE                            (4U)
#define EAD_RANDOMZER_SIZE                      (5U)
#define MAX_ADV_PAYLOAD                         (MAX_ESL_PAYLOAD_SIZE + 2 + EAD_RANDOMZER_SIZE + EAD_MIC_SIZE + 2)

typedef struct {
  uint16_t conn_handle;
  uint8_t group_id;
  uint8_t esl_id;
  resp_cb_t resp_cb;
  uint8_t cmd[0];  
} cmd_ECP_buff_t;
    
typedef struct {
  tListNode node;
  uint8_t retransmissions;
  resp_cb_t resp_cb;
  uint8_t cmd[0];  
} cmd_buff_t;

/* List of ESL bonded to AP */
typedef struct {
  tListNode cmd_queue;
  uint8_t adv_packet_len;
  uint8_t adv_packet[MAX_ADV_PAYLOAD];
} esl_group_info_t;

esl_group_info_t esl_group_info[MAX_GROUPS];

cmd_ECP_buff_t* cmd_ECP_buff;

uint8_t esl_id_sync_pck; 

uint8_t old_group_id, old_esl_id, new_group_id, new_esl_id = 0x00;

bool bUpdatingTransition = false;

extern uint16_t esl_address;

void ESL_AP_Init(void)
{  
  for(int i = 0; i < MAX_GROUPS; i++)
  {
    LST_init_head(&esl_group_info[i].cmd_queue);
  }
}

static void * prepare_cmd_buff(uint8_t cmd_opcode, uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb)
{
  uint8_t cmd_length;
  cmd_buff_t * cmd_buff;
  
  if(group_id >= MAX_GROUPS)
    return NULL;
  
  cmd_length = GET_LENGTH_FROM_OPCODE(cmd_opcode);
  
  cmd_buff = malloc(sizeof(cmd_buff_t)+cmd_length);
  
  if(cmd_buff == NULL)
    return NULL;
  
  LST_insert_tail(&esl_group_info[group_id].cmd_queue, &cmd_buff->node);
  
  cmd_buff->resp_cb = resp_cb;
  
  if(esl_id == BRC_ESL_ID)
  {
    cmd_buff->retransmissions = BRC_RETRANSMISSIONS;
  }
  else
  {
    cmd_buff->retransmissions = UNC_RETRANSMISSIONS;
  }
  
  cmd_buff->cmd[0] = cmd_opcode;
  cmd_buff->cmd[1] = esl_id;
  
  return cmd_buff;
}

// to prepare cmd packet on Updating state and send command by ECP char
static uint8_t prepare_cmd_ECP_buff(uint8_t cmd_opcode, uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb)
{
  uint8_t cmd_length;
  
  if(group_id >= MAX_GROUPS)
    return 0;
  
  cmd_length = GET_LENGTH_FROM_OPCODE(cmd_opcode);
  
  if (cmd_ECP_buff != NULL)
    free(cmd_ECP_buff);
  
  cmd_ECP_buff = malloc(sizeof(cmd_ECP_buff_t)+cmd_length);
  
  if(cmd_ECP_buff == NULL)
    return 0;
  
  cmd_ECP_buff->group_id = group_id;
  cmd_ECP_buff->esl_id = esl_id;
  
  cmd_ECP_buff->resp_cb = resp_cb;
  
  cmd_ECP_buff->cmd[0] = cmd_opcode;
  cmd_ECP_buff->cmd[1] = esl_id;
  
  return cmd_length;
}

/* If bResponse is true the command wait for an ESL response
   else the command has no response */
static uint8_t ESL_AP_SendCmdByECP(uint8_t cmd_length, bool bResponse)
{
  tBleStatus ble_status;
  
  ble_status = ESL_AP_write_ECP(cmd_ECP_buff->cmd, cmd_length, &cmd_ECP_buff->conn_handle, bResponse);
  if (ble_status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> ESL_AP_write_ECP - fail, result: 0x%02X\n", ble_status);
  }
  else
  {
    APP_DBG_MSG("==>> Success: ESL_AP_write_ECP\n");
  }     
  
  return ble_status;
}

void ECP_respCB(uint16_t connHandle, uint8_t *current_data_resp_p)
{
  if (connHandle == cmd_ECP_buff->conn_handle)
  {
    cmd_ECP_buff->resp_cb(cmd_ECP_buff->group_id, cmd_ECP_buff->esl_id, current_data_resp_p);
  }
}

uint8_t ESL_AP_command(uint8_t cmd_opcode, uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb)
{
  cmd_buff_t * cmd_buff;
  uint8_t cmd_length;
  esl_bonded_t* esl_node;

  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id);   
  if (esl_node == NULL)  
    return 2;
  
  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) != 0)
  { 
    // to prepare cmd packet on Synchronized state
    cmd_buff = prepare_cmd_buff(cmd_opcode, group_id, esl_id, resp_cb);
    if(cmd_buff == NULL)
      return 2;
  } 
  else
  {   
    // to prepare cmd packet on Updating state, because ESL is connected to AP
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
       
    if(cmd_ECP_buff == NULL)
      return 1;
    
    // to send command by ECP char
    if (esl_id == BRC_ESL_ID)
      return 1;
    else
      ESL_AP_SendCmdByECP(cmd_length, true);
  }  
  return 0;  
}

static void Led_cmd_buff(uint8_t *cmd, uint8_t led_index, uint8_t led_component, uint64_t flash_pattern, uint8_t off_period, uint8_t on_period, uint16_t repeat) 
{
  cmd[2] = led_index;
  /* if the LED is a monochrome LED, the value of the Color fields shall be ignored.*/
  cmd[3] = led_component; /* RGB and Brightness component. Not used.  */                          
  
  //Flashing pattern
  memcpy(&cmd[4], &flash_pattern, 5);
  //Flashing off period
  cmd[9] = off_period;
  //Flashing on period
  cmd[10] = on_period;
  
  //Repeat type and duration
  memcpy(&cmd[11], &repeat, 2);
}

uint8_t ESL_AP_cmd_led_control(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb, uint8_t led_index, uint8_t led_component, uint64_t flash_pattern, uint8_t off_period, uint8_t on_period, uint16_t repeat)
{
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_LED_CONTROL;
  esl_bonded_t* esl_node;
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id);   
  if (esl_node == NULL)  
    return 2;
  
  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) != 0)    
  {   
    // to prepare cmd packet on Synchronized state
    cmd_buff = prepare_cmd_buff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    Led_cmd_buff(cmd_buff->cmd, led_index, led_component, flash_pattern, off_period, on_period, repeat);
  }
  else
  {  
    // to prepare cmd packet on Updating state
    uint8_t cmd_length;
    
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_ECP_buff == NULL)
      return 1;
    
    Led_cmd_buff(cmd_ECP_buff->cmd, led_index, led_component, flash_pattern, off_period, on_period, repeat);
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);
  }  
  
