STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/esl_profile_ap.c
  return 0;  
}

/* Can send a maximum of 11 characters. */
uint8_t ESL_AP_cmd_txt(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb, const char *txt)
{
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_VS_TXT;
  uint8_t cmd_length;
  esl_bonded_t* esl_node;
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id);   
  if (esl_node == NULL)  
    return 2;
  
  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) != 0)
  { 
    // to prepare cmd packet on Synchronized state  
    cmd_buff = prepare_cmd_buff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    cmd_length = GET_LENGTH_FROM_OPCODE(cmd_opcode);
    
    memset(&cmd_buff->cmd[2], 0, cmd_length-2);
    memcpy(&cmd_buff->cmd[2], txt, MIN(strlen(txt), cmd_length-2));
  }
  else
  {
    // to prepare cmd packet on Updating state
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
     
    if(cmd_ECP_buff == NULL)
      return 1;  
    
    memset(&cmd_ECP_buff->cmd[2], 0, cmd_length-2);
    memcpy(&cmd_ECP_buff->cmd[2], txt, MIN(strlen(txt), cmd_length-2));
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);
  }  
  
  return 0;  
}

uint8_t ESL_AP_cmd_price(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb, uint16_t val_int, uint8_t val_fract)
{
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_VS_PRICE;
  esl_bonded_t* esl_node;
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id);   
  if (esl_node == NULL)  
    return 2;
  
  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) != 0)
  { 
    // to prepare cmd packet on Synchronized state  
    cmd_buff = prepare_cmd_buff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    HOST_TO_LE_16(&cmd_buff->cmd[2],val_int);
    cmd_buff->cmd[4] = val_fract;
  }
  else
  { 
    // to prepare cmd packet on Updating state  
    uint8_t cmd_length;
    
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
     
    if(cmd_ECP_buff == NULL)
      return 1;
    
    HOST_TO_LE_16(&cmd_ECP_buff->cmd[2],val_int);
    cmd_ECP_buff->cmd[4] = val_fract;
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);
  }
  
  return 0;  
}

uint8_t ESL_AP_cmd_read_sensor_data(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb, uint8_t sensor_index)
{
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_READ_SENSOR_DATA;
  esl_bonded_t* esl_node;
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id);   
  if (esl_node == NULL)  
    return 2;
  
  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) != 0)  
  {   
    // to prepare cmd packet on Synchronized state  
    cmd_buff = prepare_cmd_buff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    cmd_buff->cmd[2] = sensor_index;
  }
  else
  {
    // to prepare cmd packet on Updating state  
    uint8_t cmd_length;
    
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
      
    if(cmd_ECP_buff == NULL)
      return 1;
    
    cmd_ECP_buff->cmd[2] = sensor_index;
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);
  }  
  
  return 0;  
}

uint8_t ESL_AP_cmd_display_image(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb, uint8_t display_index, uint8_t image_index)
{
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_DISPLAY_IMG;
  esl_bonded_t* esl_node;
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id);   
  if (esl_node == NULL)  
    return 2;
  
  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) != 0)
  { 
    // to prepare cmd packet on Synchronized state  
    cmd_buff = prepare_cmd_buff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    cmd_buff->cmd[2] = display_index;
    cmd_buff->cmd[3] = image_index;
  }
  else
  {
    // to prepare cmd packet on Updating state  
    uint8_t cmd_length;
    
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
  
    if(cmd_ECP_buff == NULL)
      return 1;
    
    cmd_ECP_buff->cmd[2] = display_index;
    cmd_ECP_buff->cmd[3] = image_index;  
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);
  }  

  return 0;  
}

uint8_t ESL_AP_cmd_led_timed_control(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb, 
                                     uint8_t led_index, uint8_t led_component, 
                                     uint64_t flash_pattern, uint8_t off_period, 
                                     uint8_t on_period, uint16_t repeat, 
                                     uint32_t absolute_time)
{
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_LED_TIMED_CONTROL;
  esl_bonded_t* esl_node;
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id);   
  if (esl_node == NULL)  
    return 2;
  
  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) != 0)    
  {   
    // to prepare cmd packet on Synchronized state
    cmd_buff = prepare_cmd_buff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    Led_cmd_buff(cmd_buff->cmd, led_index, led_component, flash_pattern, off_period, on_period, repeat);
    HOST_TO_LE_32(&cmd_buff->cmd[13], absolute_time);
  }
  else
  {  
    // to prepare cmd packet on Updating state
    uint8_t cmd_length;
    
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
   
    if(cmd_ECP_buff == NULL)
      return 1;
    
    Led_cmd_buff(cmd_ECP_buff->cmd, led_index, led_component, flash_pattern, off_period, on_period, repeat);
    HOST_TO_LE_32(&cmd_ECP_buff->cmd[13], absolute_time);
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);
  }  

