STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/esl_profile_ap.c
  return 0;  
}

uint8_t ESL_AP_cmd_display_timed_image(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb, uint8_t display_index, uint8_t image_index, uint32_t absolute_time)
{
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_DISPLAY_TIMED_IMG;
  esl_bonded_t* esl_node;
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id);   
  if (esl_node == NULL)  
    return 2;
  
  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) != 0)
  { 
    // to prepare cmd packet on Synchronized state  
    cmd_buff = prepare_cmd_buff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    cmd_buff->cmd[2] = display_index;
    cmd_buff->cmd[3] = image_index;
    HOST_TO_LE_32(&cmd_buff->cmd[4], absolute_time);
  }
  else
  {
    // to prepare cmd packet on Updating state  
    uint8_t cmd_length;
    
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
  
    if(cmd_ECP_buff == NULL)
      return 1;
    
    cmd_ECP_buff->cmd[2] = display_index;
    cmd_ECP_buff->cmd[3] = image_index;
    HOST_TO_LE_32(&cmd_ECP_buff->cmd[4], absolute_time);
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);  
  }
 
  return 0;  
}

uint8_t ESL_AP_cmd_factory_reset(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb)
{
  uint8_t cmd_opcode = ESL_CMD_FACTORY_RESET;
  esl_bonded_t* esl_node;

  /* The Factory Reset command is reserved for use in the Configuring state and  
     the Updating state, the AP shall not send the Factory Reset command to an 
     ESL that is in the Synchronized state. */ 
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id); 
  if (esl_node == NULL)  
    return 2;

  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) == 0)
  { 
    // to prepare cmd packet on Updating state  
    uint8_t cmd_length;
    
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
  
    if(cmd_ECP_buff == NULL)
      return 1;
    
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, false);   //No response
    return 0;
  } 
  
  return  1;
}

uint8_t ESL_AP_cmd_update_complete(uint8_t group_id, uint8_t esl_id)
{
  uint8_t cmd_opcode = ESL_CMD_UPDATE_COMPLETE;
  esl_bonded_t* esl_node;

  /* The Update Complete command is reserved for use in the Configuring state and  
     the Updating state. */ 
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id); 
  if (esl_node == NULL)  
    return 2;

  /* Update complete can be sent only if ESL is connected. */
  if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) == 0)
  { 
    // to prepare cmd packet on Updating state  
    uint8_t cmd_length;
    
    cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, NULL);
  
    if(cmd_ECP_buff == NULL)
      return 1;
    
    // to send command by ECP char
    if (ESL_AP_SendCmdByECP(cmd_length, false) == BLE_STATUS_SUCCESS)   //No response 
    {  
      bUpdatingTransition = false;
      /* After the Update Complete command sending, the AP shall start the PAST procedure */  
      //Start PAST procedure (call "periodic_sync_info_transfer")
      UTIL_SEQ_SetTask( 1U << CFG_TASK_START_INFO_TRANSFER, CFG_SEQ_PRIO_0);
      esl_node->esl_info.state = ESL_STATE_SYNCHRONIZED;
      APP_DBG_MSG("Synchronized State transition \n ");
      return 0;
    }  
  } 
  return  1;
}

uint8_t ESL_AP_cmd_refresh_display(uint8_t group_id, uint8_t esl_id, uint8_t display_index, resp_cb_t resp_cb)
{
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_REFRESH_IMG;
  esl_bonded_t* esl_node;
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(group_id, esl_id);   
  if (esl_node != NULL)  
  {
    if (memcmp(get_bleAppContext_address(), esl_node->esl_info.Peer_Address, BD_ADDR_SIZE) != 0)  
    {   
      // to prepare cmd packet on Synchronized state  
      cmd_buff = prepare_cmd_buff(cmd_opcode, group_id, esl_id, resp_cb);
      
      if(cmd_buff == NULL)
        return 1;
      
      cmd_buff->cmd[2] = display_index;
    }
    else
    {
      // to prepare cmd packet on Updating state  
      uint8_t cmd_length;
      
      cmd_length = prepare_cmd_ECP_buff(cmd_opcode, group_id, esl_id, resp_cb);
        
      if(cmd_ECP_buff == NULL)
        return 1;
      
      cmd_ECP_buff->cmd[2] = display_index;
      // to send command by ECP char
      ESL_AP_SendCmdByECP(cmd_length, true);  
    } 
  }
  return 0;  
}

void ESL_AP_SubeventDataRequest(uint8_t subevent)
{
  tBleStatus ble_status;
  tListNode *list_head_p;
  cmd_buff_t* current_node_p;
  cmd_buff_t* node_to_remove_p = NULL;
  esl_group_info_t *esl_group_info_p;
  uint8_t curr_payload_len;
  Subevent_Data_Ptr_Parameters_t Subevent_Data_Ptr_Parameters;
  uint8_t cmd_length;
  uint8_t num_cmd = 0;
  ALIGN(4) uint8_t esl_payload_tag[MAX_ESL_PAYLOAD_SIZE + 2]; /* 2 extra bytes needed for ESL AD type and length */
  uint8_t esl_id;
  
  /* subevent is the Group ID */
  
  if(subevent >= MAX_GROUPS)
    return;
  
  esl_group_info_p = &esl_group_info[subevent];  
 
  esl_payload_tag[1] = AD_TYPE_ELECTRONIC_SHELF_LABEL;
  
  /* First byte of synchronization packet for commands is the Group ID. */
  /* Group_ID with value N shall be trasmitted in a PAwR subevent with number N */
  esl_payload_tag[2] = subevent; 
  curr_payload_len = 3; 
  
  list_head_p = &esl_group_info_p->cmd_queue;
    
  current_node_p = (cmd_buff_t*)list_head_p->next;
  
  while(&current_node_p->node != list_head_p)
  {
    num_cmd++;
    
    if(num_cmd > PAWR_NUM_RESPONSE_SLOTS && current_node_p->cmd[ESL_ID_CMD_OFFSET] != BRC_ESL_ID)
    {
      /* We do not send a unicast command if we cannot receive a response for it.
         However we can send a broadcast command regardless of the number of
         response slots, because they have no response. */
      break;
    }
    esl_id = current_node_p->cmd[ESL_ID_CMD_OFFSET];
        
    cmd_length = GET_LENGTH_FROM_OPCODE(current_node_p->cmd[0]);
    
    if(curr_payload_len + cmd_length > MAX_ESL_PAYLOAD_SIZE)
      break;
    
    memcpy(&esl_payload_tag[curr_payload_len], current_node_p->cmd, cmd_length);
    curr_payload_len += cmd_length;
    
    /* Update retransmission count and remove them from
      queue if count has reached 0. */
    if(current_node_p->retransmissions == 0)
    {
      LST_remove_node(&current_node_p->node);
      node_to_remove_p = current_node_p;
    }
    else 
    {
      current_node_p->retransmissions--;
    }
    
    LST_get_next_node(&current_node_p->node, (tListNode **)&current_node_p);
    
