STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/esl_profile_ap.c
    if(node_to_remove_p != NULL)
    {
      free(node_to_remove_p);
      node_to_remove_p = NULL;
    } 
  }
  
  if(curr_payload_len == 3)
  {
    /* No commands to be sent. */
    esl_group_info_p->adv_packet_len = 0;
    
    return;
  }
  
  esl_payload_tag[0] = curr_payload_len - 1;    /* One byte for ESL tag (AD type). */    
  
  esl_id_sync_pck = esl_id;
  
  /*
  APP_DBG_MSG("Packet:\n"); 
  int i;
  for(i=0; i<curr_payload_len-1; i++)
  {
    APP_DBG_MSG("0x%02X - ", esl_payload_tag[i]);
  }  
  APP_DBG_MSG("0x%02X\n", esl_payload_tag[i]); */
  
  /* The "ap_sync_key_material" info is the same for all ESLs */
  ble_status = aci_gap_encrypt_adv_data(ap_sync_key_material_config_value.Session_Key,
                                        ap_sync_key_material_config_value.IV,
                                        curr_payload_len,
                                        (uint32_t*)esl_payload_tag,
                                        &esl_group_info_p->adv_packet[2]); 

  esl_group_info_p->adv_packet[0] = curr_payload_len + EAD_MIC_SIZE + EAD_RANDOMZER_SIZE + 1;
  esl_group_info_p->adv_packet[1] = AD_TYPE_ENCRYPTED_ADVERTISING_DATA;
  esl_group_info_p->adv_packet_len = esl_group_info_p->adv_packet[0] + 1;
  
    
  Subevent_Data_Ptr_Parameters.Subevent = subevent;
  Subevent_Data_Ptr_Parameters.Response_Slot_Start = 0;
  // to calculate the used response slots (Response_Slot_Count) depending on the current commands.
  Subevent_Data_Ptr_Parameters.Response_Slot_Count = PAWR_NUM_RESPONSE_SLOTS;
  Subevent_Data_Ptr_Parameters.Subevent_Data_Length = esl_group_info_p->adv_packet_len ;
  Subevent_Data_Ptr_Parameters.Subevent_Data = esl_group_info_p->adv_packet;
  
  ble_status = ll_set_periodic_advertising_subevent_data_ptr(0, 1, &Subevent_Data_Ptr_Parameters);  
  if (ble_status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> ll_set_periodic_advertising_subevent_data_ptr - fail, result: 0x%02X\n", ble_status);
  }
  else
  {
    APP_DBG_MSG("==>> Success: ll_set_periodic_advertising_subevent_data_ptr\n");
  }  
}

void ESL_AP_ResponseReport(uint8_t subevent, uint8_t response_slot, uint8_t data_length, uint8_t *data)
{
  esl_group_info_t *esl_group_info_p;
  tListNode *list_head_p;
  cmd_buff_t* current_node_p;
  cmd_buff_t* node_to_remove_p = NULL;
  uint8_t *current_data_resp_p;
  uint8_t resp_length;

  ALIGN(4) uint8_t decrypted_data[MAX_ESL_PAYLOAD_SIZE];
  uint8_t decrypted_data_length;
  uint8_t encrypted_data_length;
  tBleStatus ret;
  
  esl_bonded_t* esl_node; 

  /* subevent correspond to group_id */
   
  if(subevent >= MAX_GROUPS)
    return;
  
  /* We assume only one AD type is present */
  if(data[1] != AD_TYPE_ENCRYPTED_ADVERTISING_DATA)
    return;
  
  /* ADV data decryption */
  /* ADV packet length - 2 for Len and ED Tag (see Fig 5.1 ESL profile spec) */
  encrypted_data_length = data_length - 2; 
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/ 
  esl_node = ESL_AP_return_ESL_bonded(subevent, esl_id_sync_pck);
  if (esl_node == NULL)
  {  
    return;
  }  
  /* take the "esl_resp_key_material" info by esl_node */  
  ret = aci_gap_decrypt_adv_data(esl_node->esl_info.esl_resp_key_material.Session_Key,
                                 esl_node->esl_info.esl_resp_key_material.IV,
                                 encrypted_data_length,
                                 &data[2], //Encrypted data on ADV packet 
                                 (uint32_t *)decrypted_data);
  
  if(ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Decryption fail.\n");
    return;
  }
  
  decrypted_data_length = decrypted_data[0] + 1;

  if((decrypted_data_length != encrypted_data_length - EAD_RANDOMZER_SIZE - EAD_MIC_SIZE) ||
     (decrypted_data[1] != AD_TYPE_ELECTRONIC_SHELF_LABEL))
  {
    return;
  }  
 
  /* Inspect sent commands and link them to the responses. */
  esl_group_info_p = &esl_group_info[subevent];
  
  list_head_p = &esl_group_info_p->cmd_queue;
    
  current_node_p = (cmd_buff_t*)list_head_p->next;
  
  current_data_resp_p = decrypted_data + 2; /* Skip first 2 bytes for AD length and type. */
  
  while(&current_node_p->node != list_head_p && current_data_resp_p < decrypted_data + decrypted_data_length)
  {
    if(current_node_p->cmd[ESL_ID_CMD_OFFSET] == esl_id_sync_pck)
    {
      if(current_node_p->resp_cb != NULL)
      {
        current_node_p->resp_cb(subevent, esl_id_sync_pck, current_data_resp_p);
      }
      
      /* Command has received a response. Remove from queue. */      
      LST_remove_node(&current_node_p->node);      
      node_to_remove_p = current_node_p;
      
      /* Pass to following response. */
      resp_length = GET_LENGTH_FROM_OPCODE(current_data_resp_p[0]);
      current_data_resp_p += resp_length;
    }
    
    LST_get_next_node(&current_node_p->node, (tListNode **)&current_node_p);
    
    if(node_to_remove_p != NULL)
    {
      free(node_to_remove_p);
      node_to_remove_p = NULL;
    }    
  }  
}

uint8_t ESL_AP_cmd_reconfig_esl_address(uint8_t group_id, uint8_t esl_id, uint8_t n_group_id, uint8_t n_esl_id)
{
  if((group_id >= MAX_GROUPS) || (n_group_id >= MAX_GROUPS))
    return 1;
  old_group_id = group_id;
  old_esl_id = esl_id;
  new_group_id = n_group_id;
  new_esl_id = n_esl_id;
   
  bUpdatingTransition = false;
  
  //Set the AP status 
  UTIL_SEQ_SetTask( 1u << CFG_TASK_UPDATING_STATE_TRANSITION, CFG_SEQ_PRIO_0);
  return 0;
}  

uint8_t ESL_AP_cmd_updating_state(uint8_t group_id, uint8_t esl_id)
{
  if(group_id >= MAX_GROUPS)
    return 1;
  old_group_id = group_id;
  old_esl_id = esl_id;
   
  bUpdatingTransition = true;
  //Set the AP status 
  UTIL_SEQ_SetTask( 1u << CFG_TASK_UPDATING_STATE_TRANSITION, CFG_SEQ_PRIO_0);
  return 0;
} 

//Task for CFG_TASK_UPDATING_STATE_TRANSITION
void ESL_AP_UpdatingStateTransition(void)
{
  esl_bonded_t* esl_node;
  
  /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
  esl_node = ESL_AP_return_ESL_bonded(old_group_id, old_esl_id);   
  if (esl_node != NULL)
  {
    APP_DBG_MSG("!!! ESL_AP_UpdatingStateTransition - ESL state: %d \n", esl_node->esl_info.state);
    if (esl_node->esl_info.state == ESL_STATE_SYNCHRONIZED)
    {  
      if (!bUpdatingTransition)
      {
        set_AP_Status(ESL_AP_UPDATING_ESL_ADDRESS);
      }  
      /* To transition an ESL from the Synchronized state to the Updating state, 
         the AP shall use the Periodic Advertising Connection procedure.
         When the AP connects with the ESL, the ESL transitions to the Updating state. */
      create_periodic_advertising_connection(old_group_id, esl_node->esl_info.Peer_Address, esl_node->esl_info.Peer_Address_Type);  

      esl_node->esl_info.state = ESL_STATE_UPDATING;  // to this is done after connection complete event. Remove.
      APP_DBG_MSG("Updating State transition\n");
    }
  }  
  else
    APP_DBG_MSG("!!!!  ESL_AP_UpdatingStateTransition - esl_node == NULL\n");
}

uint16_t ESL_AP_New_esl_address(void)
{
  return ESL_AP_return_ESL_address(new_group_id, new_esl_id);
}

esl_bonded_t* ESL_AP_return_ESL_to_Update(void)
{
  return ESL_AP_return_ESL_bonded(old_group_id, old_esl_id);
}


uint8_t ESL_AP_cmd_provisioning(uint8_t addr_type, uint8_t address[6], uint8_t group_id, uint8_t esl_id)
{
  if(group_id >= MAX_GROUPS)
    return 1;
  
  //to check if group_id and esl_id is already assigned to another ESL
  esl_address = (group_id << 8) | esl_id;
  if (Search_by_ESL_address_In_List(esl_address) != NULL)
  {  
    APP_DBG_MSG("ESL Address (0x%04X) already assigned!\n", esl_address);
    return 1;
  }
  
  set_bleAppContext_address(addr_type, address);
  
  // Connect to ESL address  
  UTIL_SEQ_SetTask(1u << CFG_TASK_CONN_DEV_ID, CFG_SEQ_PRIO_0);

  return 0;
} 